"""
Даны 2 числа a и b. Получить их сумму, разность и произведение
"""


a = float(input("Введите значение переменной \"a\" (число!): "))
b = float(input("Введите значение переменной \"b\" (число!): "))

sum_of_numbers = a + b
difference = a - b
product = a * b

print(f"Сумма чисел: {sum_of_numbers}, разность чисел: {difference}, произведение чисел: {product}")
